package com.qichen.code;

/**
 * @author qichen
 * @Date 2019/10/19
 * @since JDK1.8
 */
/*
    运算符是一种特殊的符号，用以表示数据的运算、赋值和比较等。
        算术运算符
            运算符      运算                          范例             结果
            +           正号                          +3                  3
            -           负号                          b=4; -b             -4
            +           加                            5+5                10
            -           减                            6-4                2
            *           乘                            3*4                12
            /           除                            5/5                1
            %           取模(取余)                    7%5               2
            ++          自增（前）：先运算后取值      a=2;b=++a;        a=3;b=3
            ++          自增（后）：先取值后运算      a=2;b=a++;        a=3;b=2
            --          自减（前）：先运算后取值      a=2;b=- -a        a=1;b=1
            --          自减（后）：先取值后运算      a=2;b=a- -        a=1;b=2
            +           字符串连接                    “He”+”llo”     “Hello”
        赋值运算符
            符号： =
                当“=”两侧数据类型不一致时， 可以使用自动类型转换或使用强制类型转换原则进行处理。
                支持连续赋值。
            扩展赋值运算符： +=, -=, *=, /=, %=
        比较运算符（关系运算符）

            比较运算符的结果都是boolean型，也就是要么是true，要么是false。
        逻辑运算符
            &—逻辑与 | —逻辑或 ！ —逻辑非 && —短路与 || —短路或 ^ —逻辑异或
            逻辑运算符用于连接布尔型表达式，
        位运算符
             位运算是直接对整数的二进制进行的运算
        三元运算符
            格式:
                 (条件表达式)?表达式1：表达式2；
                    为true， 运算后的结果是表达式1；
                    为false， 运算后的结果是表达式2；
                 表达式1和表达式2为同种类型
                 三元运算符与if-else的联系与区别：
                    1）三元运算符可简化if-else语句；
                    2）三元运算符要求必须返回一个结果；
                    3）if后的代码块可有多个语句。
 */
public class Operator {
}
